app/controllers/relationships_controller.rb

	def create
		@user = User.find(params[:user_id])
		@relationship = Relationship.new
		@relationship.follow_user_id = current_user.id
		@relationship.follower_user_id = @user.id
		@relationship.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "relationships" ("follow_user_id", "created_at", "updated_at", "follower_user_id") VALUES (?, ?, ?, ?)  [["follow_user_id", 3], ["created_at", "2020-08-06 20:50:27.068235"], ["updated_at", "2020-08-06 20:50:27.068235"], ["follower_user_id", 1]]

	def destroy
		@user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]