app/controllers/users_controller.rb

UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "a"], ["profile_image_id", "26161ea10e596f7ab069c2a63b6a15a26e2c40d453866835f71d762aa4c8"], ["updated_at", "2020-08-02 11:33:28.842421"], ["id", 3]]
---
  def update
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def follows
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def followers
    @user = User.find(params[:id])